-- MySQL dump 10.13  Distrib 5.7.17, for Win64 (x86_64)
--
-- Host: localhost    Database: hhips
-- ------------------------------------------------------
-- Server version	5.7.21-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `sourcechapter`
--

DROP TABLE IF EXISTS `sourcechapter`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `sourcechapter` (
  `idsourcechapter` int(11) NOT NULL AUTO_INCREMENT,
  `sourcechaptername` varchar(45) DEFAULT NULL,
  `sourcechapterindex` int(11) DEFAULT NULL,
  `sourceid` int(11) DEFAULT NULL,
  PRIMARY KEY (`idsourcechapter`),
  KEY `sourceid_idx` (`sourceid`),
  CONSTRAINT `sourceid` FOREIGN KEY (`sourceid`) REFERENCES `source` (`idsource`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=298 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sourcechapter`
--

LOCK TABLES `sourcechapter` WRITE;
/*!40000 ALTER TABLE `sourcechapter` DISABLE KEYS */;
INSERT INTO `sourcechapter` VALUES (1,'质数与合数',1,4),(2,'统筹与最优',2,4),(3,'加乘原理进阶',3,4),(4,'流水行船',4,4),(5,'抽屉原理初步',5,4),(7,'tests',1,10000),(8,'最值原理进阶',6,4),(9,'进位制初步',7,4),(10,'分解质因数',8,4),(11,'相遇与追及综合',9,4),(12,'整数与数列',10,4),(13,'平移旋转与对称',11,4),(14,'定义新运算',1,2),(15,'体育比赛中的数学',2,2),(16,'图形计数进阶',3,2),(17,'大数计算',4,2),(18,'等积变形',5,2),(19,'等高模型',6,2),(20,'一半模型',7,2),(21,'最值初步',8,2),(22,'幻方',9,2),(23,'平均数进阶',10,2),(24,'乘除法竖式',11,2),(25,'方程组',12,2),(26,'解应用题',13,2),(27,'环形跑道',14,2),(28,'火车过桥',15,2),(29,'图形的分割与剪拼',12,4),(30,'破译横式',13,4),(31,'牛吃草',14,4),(32,'数阵图中的奥秘',15,4),(33,'多位数计算',1,5),(34,'整数巧算',2,5),(35,'小数计算',3,5),(36,'数列',4,5),(37,'数表',5,5),(38,'加法原理',6,5),(39,'乘法原理',7,5),(40,'加乘综合',8,5),(41,'应用题综合一',9,5),(42,'应用题综合二',10,5),(43,'基本行程',11,5),(44,'相遇问题',12,5),(45,'追及问题',13,5),(46,'基本法求面积',14,5),(47,'分割法求面积',15,5),(48,'其他求面积',16,5),(49,'数字谜',17,5),(50,'幻方数阵图',18,5),(51,'抽屉原理',19,5),(52,'图形最值',20,5),(53,'应用最值',21,5),(54,'数字最值',22,5),(55,'统筹',23,5),(56,'计算综合',1,8),(57,'数阵图初步',2,8),(58,'竖式问题',3,8),(59,'几何图形剪拼',4,8),(60,'行程问题1',5,8),(61,'抽屉原理1',6,8),(62,'直线型计算1',7,8),(63,'和差倍3',8,8),(64,'还原与年龄',9,8),(65,'数列与数表',10,8),(66,'加乘原理',11,8),(67,'统筹与对策',12,8),(68,'多位数与小数',13,8),(69,'平均数',14,8),(70,'复杂竖式',15,8),(71,'横式问题',16,8),(72,'格点与割补',17,8),(73,'行程问题2',18,8),(74,'行程问题3',19,8),(75,'数阵图扩展',20,8),(76,'排列组合',21,8),(77,'计数综合',22,8),(78,'最值问题',23,8),(79,'逻辑推理1',24,8),(80,'小数巧算',1,3),(81,'格点与割补',2,3),(82,'数表',3,3),(83,'必胜策略',4,3),(84,'整除特征二',5,3),(85,'包含与排除',6,3),(86,'智趣巧题',7,3),(87,'比较与估算',1,6),(88,'四则运算',2,6),(89,'裂项',3,6),(90,'数列',4,6),(91,'数表',5,6),(92,'定义新运算',6,6),(93,'枚举法',7,6),(94,'加乘原理',8,6),(95,'包含与排除',9,6),(96,'排列与组合',10,6),(97,'几何计数',11,6),(98,'分数应用题',12,6),(99,'牛吃草问题',13,6),(100,'工程问题',14,6),(101,'火车过桥与流水行船',15,6),(102,'环形跑道与钟面行程',16,6),(103,'相遇与追及',17,6),(104,'等积变形',18,6),(105,'图形变换',19,6),(106,'弦图勾股定理',20,6),(107,'立体几何',21,6),(108,'进位位值原理',22,6),(109,'数的整除',23,6),(110,'质数合数',24,6),(111,'因数倍数',25,6),(112,'带余除法',26,6),(113,'完全平方数',27,6),(114,'数字迷综合',28,6),(115,'数独',29,6),(116,'逻辑推理',30,6),(117,'操作类问题',31,6),(118,'计算综合',1,7),(119,'应用题综合',2,7),(120,'行程问题',3,7),(121,'曲线几何',4,7),(122,'直线型几何1',5,7),(123,'直线型几何2',6,7),(124,'立体几何',7,7),(125,'数论综合1',8,7),(126,'数论综合2',9,7),(127,'计数综合1',10,7),(128,'计数综合2',11,7),(129,'最值问题综合',12,7),(130,'构造与论证',13,7),(131,'逻辑推理',14,7),(132,'数学谜题',15,7),(133,'古诗词',1,100),(134,'计数第1节——枚举法',1,11),(135,'计数第2节——树形图之传球表格',2,11),(136,'计数第3节——树形图之路线问题',3,11),(137,'计算小花园1',16,4),(138,'计算小花园2',17,4),(139,'计算小花园3',18,4),(140,'计数第4节——标数法',4,11),(141,'计数第5节——递推法',5,11),(142,'计数第6节——加乘原理的区分',6,11),(143,'计数第7节——排列与捆绑、插空',7,11),(144,'计数第8节——组合与插板、除法定序（一）',8,11),(145,'计数第9节——组合与插板、除法定序（二）',9,11),(146,'计数第10节——计数综合分类讨论（一）',10,11),(147,'计数第11节——计数综合分类讨论（二）',11,11),(148,'计数第12节——旋转对称算一种',12,11),(149,'分久必合合久必分',1,12),(150,'因数倍数知多少',2,12),(151,'有序枚举靠分类',3,12),(152,'顺理成章-周期数列',4,12),(153,'棋盘中的奥秘',5,12),(154,'分数乘除',6,12),(155,'分数加减',7,12),(156,'计算小超市',8,12),(157,'分数应用题',9,12),(158,'站七坐五蹲三半-比例问题',10,12),(159,'三角形中的面积关系-鸟头',11,12),(160,'两父两子仅三人-容斥',12,12),(161,'赛场上的侦探-比赛问题',13,12),(162,'商场里的扶梯',14,12),(163,'行程中的等量关系',15,12),(164,'计数中的递推',1,16),(165,'比较与估算',2,16),(166,'直线型计算之风筝模型',3,16),(167,'直线型计算之燕尾模型',4,16),(168,'直线型计算之沙漏模型',5,16),(169,'钟表问题',6,16),(170,'不定方程与整数分拆',7,16),(171,'进制与位值原理',8,16),(172,'浓度问题',9,16),(173,'经济问题',10,16),(174,'染色问题',11,16),(175,'第一讲课前测',12,16),(176,'第二讲课前测',13,16),(177,'第三讲课前测',14,16),(178,'第四讲课前测',15,16),(179,'第五讲课前测',16,16),(180,'第六讲课前测',17,16),(181,'第七讲课前测',18,16),(182,'第八讲课前测',19,16),(183,'第九讲课前测',20,16),(184,'第十讲课前测',21,16),(185,'第十一讲课前测',22,16),(186,'第十二讲课前测',23,16),(187,'余数的性质',1,13),(188,'分数巧算',1,17),(189,'几何计数',2,17),(190,'抽屉原理分组',3,17),(191,'抽屉原理构造',4,17),(192,'圆与扇形一',5,17),(193,'圆与扇形二',6,17),(194,'行程问题正反比例',7,17),(195,'行程问题变速分段',8,17),(196,'方程解应用题',9,17),(197,'计数中的对应法',10,17),(198,'完全平方数',11,17),(199,'直线型模型进阶',12,17),(200,'取整与分数分拆',13,17),(201,'立体几何',14,17),(202,'比赛逻辑',15,17),(203,'第一讲课前测',16,17),(204,'第二讲课前测',17,17),(205,'第三讲课前测',18,17),(206,'第四讲课前测',19,17),(207,'第五讲课前测',20,17),(208,'第六讲课前测',21,17),(209,'第七讲课前测',22,17),(210,'第八讲课前测',23,17),(211,'第九讲课前测',24,17),(212,'第十讲课前测',25,17),(213,'分数运算',2,13),(214,'比例应用题',3,13),(215,'因数的求法及应用',4,13),(216,'风筝模型',5,13),(217,'神奇的9',6,13),(218,'乘除法数字谜',7,13),(219,'PET-Part1',1,200),(220,'PET-Part2',2,200),(221,'PET-Part3',3,200),(222,'PET-Part4',4,200),(223,'PET-Part5',5,200),(224,'分数计算与比较大小',1,9),(225,'整除',2,9),(226,'质数与合数',3,9),(227,'包含与排除',4,9),(228,'行程问题四',5,9),(229,'几何计数',6,9),(230,'约数与倍数',7,9),(231,'分数与循环小数',8,9),(232,'比较与估算',9,9),(233,'数字谜综合一',10,9),(234,'和差倍分问题',11,9),(235,'应用题拓展',12,9),(236,'计算综合一',13,9),(237,'直线型计算二',14,9),(238,'圆与扇形',15,9),(239,'余数',16,9),(240,'工程问题',17,9),(241,'牛吃草与钟表',18,9),(242,'直线型计算三',19,9),(243,'行程问题五',20,9),(244,'数字问题',21,9),(245,'计数综合二',22,9),(246,'构造论证一',23,9),(247,'抽屉原理二',24,9),(248,'几何第1节-基本方法上',13,11),(249,'几何第2节-基本方法下',14,11),(250,'几何第3节-一半模型',15,11),(251,'作文',2,100),(252,'几何第4节-弦图与勾股定理上',16,11),(253,'几何第5节-弦图与勾股定理下',17,11),(254,'几何第6节-鸟头风筝沙漏上',18,11),(255,'几何第7节-鸟头风筝沙漏下',19,11),(256,'几何第8节-双峰与燕尾',20,11),(257,'几何第9节-定比分点定理',21,11),(258,'几何第10节-直线型几何综合题上',22,11),(259,'几何第11节-直线型几何综合题下',23,11),(260,'几何第12节-正多边形',24,11),(261,'2015五年级迎春初试',1,50),(262,'2016五年级迎春初试',2,50),(263,'2017五年级迎春初试',3,50),(264,'2018五年级迎春初试',4,50),(265,'定义新运算',8,13),(266,'圆',9,13),(267,'蝴蝶模型',10,13),(268,'平方数',11,13),(269,'工程问题',12,13),(270,'数列规律',13,13),(271,'因倍最值',14,13),(272,'必胜策略',15,13),(273,'魔术中的数学',16,13),(274,'六宫数独一',5,50),(275,'数论第1节-整除特征（一）',25,11),(276,'数论第2节-整除特征（二）',26,11),(277,'数论第3节-质数与合数',27,11),(278,'数论第4节-短除模型与辗转相减',28,11),(279,'数论第5节-因数个数定理',29,11),(280,'数论第6节-位值原理',30,11),(281,'数论第7节-进位制',31,11),(282,'数论第8节-带余除法',32,11),(283,'数论第9节-余数的运算性质与周期',33,11),(284,'数论第10节-中国剩余定理',34,11),(285,'数论第11节-不定方程',35,11),(286,'数论第12节-神奇的9',36,11),(287,'数论第13节-完全平方数（上）',37,11),(288,'数论第14节-完全平方数（下）',38,11),(289,'数论第15节-循环小数',39,11),(290,'数论第16节-高斯记号',40,11),(291,'数论第17节-数论综合（一）',41,11),(292,'数论第18节-数论综合（二）',42,11),(293,'学而思语法',6,200),(294,'第十一讲课前测',26,17),(295,'第十二讲课前测',27,17),(296,'第十三讲课前测',28,17),(297,'第十四讲课前测',29,17);
/*!40000 ALTER TABLE `sourcechapter` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-12-27 15:26:20
