-- MySQL dump 10.13  Distrib 5.7.17, for Win64 (x86_64)
--
-- Host: localhost    Database: hhips
-- ------------------------------------------------------
-- Server version	5.7.21-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `paper`
--

DROP TABLE IF EXISTS `paper`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `paper` (
  `idpaper` int(11) NOT NULL AUTO_INCREMENT,
  `papername` varchar(45) DEFAULT NULL,
  `paperdate` datetime DEFAULT NULL,
  `isactive` int(11) DEFAULT '1' COMMENT '1=in edit\n2=active, cannot edit\n3=finished, no edit, no work anymore\n4=on hold, no edit, no work\n5=archive',
  PRIMARY KEY (`idpaper`)
) ENGINE=InnoDB AUTO_INCREMENT=139 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `paper`
--

LOCK TABLES `paper` WRITE;
/*!40000 ALTER TABLE `paper` DISABLE KEYS */;
INSERT INTO `paper` VALUES (1,'四春期末复习行程问题一','2018-06-10 00:00:00',5),(2,'四春期末复习加乘一','2018-06-12 00:00:00',5),(3,'四春期末复习几何一','2018-06-20 00:00:00',5),(4,'四春期末复习行程问题二','2018-06-16 20:00:00',5),(5,'mytestpaper','2018-06-18 00:00:00',5),(6,'四春牛吃草课后巩固','2018-06-17 00:00:00',5),(7,'四春期末复习数论一','2018-06-20 00:00:00',5),(8,'四春期末复习最值一','2018-06-21 00:00:00',5),(9,'四春数阵图课后巩固','2018-06-24 00:00:00',5),(10,'四春期末复习数论二','2018-06-24 00:00:00',5),(11,'四春期末复习计算+逻辑','2018-06-25 00:00:00',5),(12,'四春期末复习综合一','2018-06-26 06:21:31',5),(13,'四春期末复习综合Last Time','2018-06-28 20:50:16',5),(14,'四春期末复习综合一波波','2018-07-01 21:45:27',5),(15,'四升五行程专项练习一','2018-07-02 22:05:04',5),(16,'四升五数列数表专项练习一','2018-07-03 06:52:14',5),(17,'四升五书写练习','2018-07-05 21:09:59',5),(18,'四升五计算练习','2018-07-06 06:22:37',5),(19,'四升五数论整除特征复习巩固','2018-07-06 06:24:14',5),(20,'四升五数论包含与排除综合复习','2018-07-06 06:34:18',5),(21,'四升五开心逻推','2018-07-08 09:50:36',5),(22,'孙佳俊模块课学习','2018-07-15 09:03:28',5),(23,'五暑几何复习综合','2018-07-15 12:02:58',5),(24,'五暑行程巩固练习','2018-07-17 06:49:28',5),(25,'五暑几何复习学学卷','2018-07-18 21:51:53',5),(26,'五暑数论复习哈哈卷','2018-07-19 06:46:43',5),(27,'五暑行程臊子面卷','2018-07-20 18:31:20',5),(28,'五暑几何access卷','2018-07-23 19:56:36',5),(29,'五暑数论article卷','2018-07-30 19:01:46',5),(30,'五暑应用题attention卷','2018-07-31 16:38:59',5),(31,'五暑应用题bloom卷','2018-08-06 18:28:51',5),(32,'五暑计数appear卷','2018-08-06 20:22:40',5),(33,'五暑因数倍数课后练习','2018-08-17 22:00:07',5),(34,'五暑标数法课后练习','2018-08-18 17:39:02',5),(35,'五暑找规律课后练习','2018-08-19 18:21:44',5),(36,'五暑棋盘中的奥秘课后练习','2018-08-20 20:57:05',5),(37,'五暑分数加减课后练习','2018-08-22 18:36:29',5),(38,'五暑预习','2018-08-24 20:44:34',5),(39,'五暑站七坐五蹲三课后作业','2018-08-25 17:08:29',5),(40,'五暑鸟头课后作业','2018-08-26 16:40:54',5),(41,'五暑计算练习','2018-08-26 17:42:23',5),(42,'五暑容斥原理作业','2018-08-27 17:31:36',5),(43,'五暑排列分组课后作业','2018-08-28 17:28:25',5),(44,'五暑扶梯课后作业','2018-08-29 18:16:31',5),(45,'五暑行程方程作业','2018-08-30 17:19:22',5),(46,'五暑分久必合质因数课后作业','2018-09-03 18:31:21',5),(47,'五秋应用题control卷','2018-09-05 21:49:12',5),(48,'五秋余数的性质','2018-09-09 09:22:33',5),(49,'五秋优才一分数计算作业','2018-09-09 20:07:47',5),(50,'五秋几何design卷','2018-09-10 06:44:19',5),(51,'五秋xes2分数计算课后','2018-09-12 18:10:32',5),(52,'五秋优才2几何计数课后','2018-09-16 21:41:15',5),(53,'五秋xes3比例应用题课后','2018-09-17 21:54:23',5),(54,'pet-part1','2018-09-20 21:13:17',5),(55,'五秋优才3抽屉原理课后','2018-09-23 17:52:48',5),(56,'五秋数论ferret卷','2018-09-25 22:01:44',5),(57,'五秋综练9.27','2018-09-27 06:45:03',5),(58,'五秋综练9.29','2018-09-27 06:53:17',5),(59,'五秋综练9.30','2018-09-28 06:30:38',5),(60,'五秋综练10.1','2018-09-28 06:38:50',5),(61,'五秋综练10.2','2018-09-28 17:53:34',5),(62,'五秋综练10.3','2018-09-28 18:05:29',5),(63,'五秋综练10.4','2018-09-29 18:44:04',5),(64,'五秋综练10.5','2018-09-29 19:19:08',5),(65,'五秋综练10.6','2018-09-29 19:25:19',5),(66,'五秋数论deposit卷','2018-09-29 19:52:26',5),(67,'五秋xes4因数课后','2018-10-07 08:10:53',5),(68,'五秋xes5风筝课后','2018-10-08 21:57:09',5),(69,'五秋综练10.14','2018-10-14 08:40:59',5),(70,'五秋综练10.15','2018-10-14 08:48:52',5),(71,'五秋优才4抽屉课后','2018-10-15 21:17:45',5),(72,'五秋xes6神奇的9课后分析版','2018-10-18 14:35:02',5),(73,'写作','2018-10-20 08:53:01',2),(74,'五秋逻辑race卷','2018-10-22 06:52:26',5),(75,'五秋优才5圆与扇形一课后','2018-10-22 21:03:45',5),(76,'五秋xes7数字谜课后','2018-10-27 21:29:37',5),(77,'五秋优才6圆与扇形二','2018-10-28 19:11:29',5),(78,'五秋最值综练','2018-10-29 19:47:52',5),(79,'五秋逻辑broach卷','2018-10-30 21:07:27',5),(80,'五秋优才7行程正反比例','2018-11-04 20:17:27',5),(81,'五秋优才8行程变速分段课后','2018-11-04 20:36:32',5),(82,'2015迎春初试','2018-11-07 21:36:17',5),(83,'2016迎春初试','2018-11-07 21:36:43',5),(84,'优才9方程','2018-11-13 06:41:45',5),(85,'学而思9圆','2018-11-13 06:53:04',5),(86,'优才课前测whim卷','2018-11-15 06:42:51',5),(87,'优才5秋课前测hold卷','2018-11-17 17:24:05',5),(88,'数独permanent卷','2018-11-19 21:25:43',2),(89,'学而思5暑temporary','2018-11-19 21:31:57',5),(90,'五秋xes10蝴蝶模型','2018-11-21 09:46:28',5),(91,'2017迎春初试','2018-11-25 20:19:17',5),(92,'2018迎春初试','2018-11-25 20:19:30',5),(93,'xer8加加','2018-11-25 20:29:05',5),(94,'xes11','2018-11-25 20:30:40',5),(95,'xes5秋复习','2018-11-26 21:04:21',5),(96,'sjj复习卷','2018-12-03 20:54:57',5),(97,'xes12','2018-12-04 19:21:43',5),(98,'yc10','2018-12-09 18:42:14',5),(99,'xes13','2018-12-09 21:11:59',5),(100,'xes9加加','2018-12-09 21:31:18',5),(101,'xes5秋复习responsible','2018-12-16 18:16:52',5),(102,'yc11讲课后','2018-12-16 18:47:29',5),(103,'xes14课后','2018-12-22 10:22:17',5),(104,'xes11加加','2018-12-22 19:01:21',5),(105,'xes15课后','2018-12-22 19:03:39',5),(106,'xes必胜relationship','2018-12-22 19:14:51',5),(107,'xes数论hydrofoil','2018-12-22 19:27:58',5),(108,'xes16课后','2018-12-22 19:45:52',5),(109,'yc12课后','2018-12-23 17:42:04',5),(110,'yc13课后','2018-12-30 19:19:08',5),(111,'yc14课后','2019-01-06 19:06:27',5),(112,'yc课前测interpreter','2019-01-10 21:07:40',5),(113,'xes数论receptionist','2019-01-12 17:35:12',5),(114,'5寒数论atmosphere','2019-01-20 10:11:07',5),(115,'5寒数论白imagine','2019-01-20 15:58:57',5),(116,'5寒几何白perform','2019-01-20 16:22:34',5),(117,'5寒pet','2019-01-20 16:26:47',5),(118,'5寒预习','2019-01-26 10:46:22',5),(119,'5寒3课后','2019-01-28 19:05:34',5),(120,'5寒4课后','2019-01-28 22:21:04',5),(121,'5寒5课后','2019-01-28 22:21:17',5),(122,'5寒6课后','2019-01-28 22:21:27',5),(123,'5寒7课后','2019-01-28 22:22:38',5),(124,'5寒应用题计数percent','2019-02-12 20:36:35',2),(125,'5寒行程几何opportunity','2019-02-12 21:12:42',5),(126,'5寒yc2课后','2019-02-13 17:34:44',5),(127,'5寒yc3课后','2019-02-14 21:33:43',5),(128,'5寒综练2.16','2019-02-16 10:43:16',5),(129,'5寒综练2.17','2019-02-16 20:07:21',5),(130,'5寒pet4','2019-02-16 20:12:56',2),(131,'5寒yc5课后','2019-02-17 09:52:27',5),(132,'5寒综练2.18','2019-02-17 20:46:31',5),(133,'5寒综练2.19','2019-02-17 21:46:29',2),(134,'5寒read5','2019-02-18 18:49:04',4),(135,'5寒综练2.21','2019-02-21 18:01:37',2),(136,'5寒综练2.22','2019-02-21 18:03:16',2),(137,'5寒综练2.23','2019-02-21 18:03:25',2),(138,'5寒综练2.24','2019-02-21 18:03:36',2);
/*!40000 ALTER TABLE `paper` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-02-22 19:20:24
